/*************************************************************************
> FileName: bitmap.c
> Author  : DingJing
> Mail    : dingjing@live.cn
> Created Time: Fri 23 Aug 2024 03:35:39 PM CST
 ************************************************************************/
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

int main (void)
{
    uint32_t size = 1024; // 0x0400

    // ffs 最低位开始，未设置 1 的位置
    printf ("%lu(%0x)\n", ffs(size), ffs(size));          // 11 第11位为0
    printf ("%lu(%0x)\n", ffs(size) - 1, ffs(size) - 1);  // 10 第10位位1

    printf ("4096:%lu(%0x)\n", ffs(4096), ffs(4096));          // 13
    printf ("4096:%lu(%0x)\n", ffs(4096) - 1, ffs(4096) - 1);  // 12

    printf ("4096 & ~7 : %lu(%0x)\n", 4096 & ~7, 4096 & ~7); 
    printf ("256 & ~7  : %lu(%0x)\n", 256 & ~7, 256 & ~7); 

    printf ("(4096 + 7) & ~7 : %lu(%0x)\n", (4096 + 7) & ~7, (4096 + 7) & ~7); 
    printf ("(256 + 7) & ~7  : %lu(%0x)\n", (256 + 7) & ~7, (256 + 7) & ~7); 

    printf ("(4090 + 7) & ~7 : %lu(%0x)\n", (4090 + 7) & ~7, (4090 + 7) & ~7); 
    printf ("(250 + 7) & ~7  : %lu(%0x)\n", (250 + 7) & ~7, (250 + 7) & ~7); 

    printf ("(200 + 7) & ~7  : %lu(%0x)\n", (200 + 7) & ~7, (200 + 7) & ~7); 

    printf ("(0 + 7) & ~7  : %lu(%0x)\n", (0 + 7) & ~7, (0 + 7) & ~7); 
    printf ("(1 + 7) & ~7  : %lu(%0x)\n", (1 + 7) & ~7, (1 + 7) & ~7); 
    printf ("(7 + 7) & ~7  : %lu(%0x)\n", (7 + 7) & ~7, (7 + 7) & ~7); 

    printf ("(88880 & (1024 - 1)) / 512 : %lu(%0x)\n", (88880 & (1024 - 1)) / 512, (88880 & (1024 - 1)) / 512);


    return 0;
}
